[
  {
    "name": "Rainbow Truffles",
    "path": "rainbow-truffles",
    "description": "Scrumptious thingies.",
    "images": [],
    "refUrl": "akdmasldmasmdk",
    "ingredients": [
      {
        "amount": 1,
        "unit": null,
        "name": "asmdalsd"
      }
    ],
    "instructions": [
      "heat oven"
    ]
  },
  {
    "name": "Chinese Steamed Buns",
    "path": "chinese-steamed-buns",
    "description": "Yum yum. We all love 馒头!",
    "images": [],
    "refUrl": "https://www.chinasichuanfood.com/chinese-steamed-buns/",
    "ingredients": [
      {
        "amount": 300,
        "unit": "gram",
        "name": "all-purpose flour (plus some for dusting)"
      },
      {
        "amount": 1.5,
        "unit": "teaspoon",
        "name": "instant yeast"
      },
      {
        "amount": 2,
        "unit": "other",
        "name": "sugar"
      },
      {
        "amount": 150,
        "unit": "gram",
        "name": "water"
      },
      {
        "amount": 1,
        "unit": "other",
        "name": "pinch salt"
      }
    ],
    "instructions": [
      "Prepare warm water around 35 °C and melt the sugar in. And mix the yeast with the water. Mix well and set aside for around 5 minutes. If you do not want sugar, just skip it.",
      "Place salt and flour in a large bowl. Pour the water with yeast slowly to the bowl with flour and stir with a chopstick.",
      "Then knead the flour into smooth and soft dough. At the very beginning, it might be a little bit sticky. Or you can simple resort to a stand mixer.",
      "Cover the bowl and let the dough rest for around 1 hour or until the paste ball doubles in size.",
      "When the dough is double in size, get paste ball out, dust the operating board and re-knead the dough for 3-4 minutes until the dough becomes almost smooth again. Divide the dough into two parts, keep kneading and shape each part into 1 inch thick long log.",
      "Remove the two ends and use a very sharp knife to cut the log to smaller pieces (around 2 cm wide). Try to keep the original shape. Place the buns to a lined steamer one by one. Leave some space among each one as the buns rise after steaming.",
      "Add cold water to your wok or steel steamer. Cover the lid and rest for 10 minutes in summer and around 20 minutes in winter or until the bun becomes fluffy again.",
      "Use high fire to bring the water to a boil and continue to steam for around 20 to 25 minutes (depending on the size of your buns).",
      "Remove off the fire and wait for around 5 minutes before opening the lid. Serve warm or re-steam to soften before serving."
    ]
  }
]
